cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xh.svd
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description>Flash Read Wait Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description>Flash Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description>Flash ECC Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Rdy</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSYNDN" -->
        <register>
          <name>FSYNDN</name>
          <description>Flash Sync Down Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>Sync Down</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FBFCR" -->
        <register>
          <name>FBFCR</name>
          <description>Flash Buffer Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BS" -->
            <field>
              <name>BS</name>
              <description>Buffer Status</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Buffer Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description>Flash Interrupt Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIE" -->
            <field>
              <name>ERRIE</name>
              <description>Flash ECC Error Interrupt Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIE" -->
            <field>
              <name>HNGIE</name>
              <description>Flash HANG Interrupt Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description>Flash RDY Interrupt Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description>Flash Interrupt Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIF" -->
            <field>
              <name>ERRIF</name>
              <description>Flash ECC Error Interrupt Flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNGIF" -->
            <field>
              <name>HNGIF</name>
              <description>Flash HANG Interrupt Flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description>Flash RDY Interrupt Flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
