cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xh.svd
        <!-- REGISTER "IRQ062MON" -->
        <register>
          <name>IRQ062MON</name>
          <description>IRQ062 Batch Read Register</description>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1_RX" -->
            <field>
              <name>MFSINT1_RX</name>
              <description>Reception interrupt request of the MFS ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ063MON" -->
        <register>
          <name>IRQ063MON</name>
          <description>IRQ063 Batch Read Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1_STATUS" -->
            <field>
              <name>MFSINT1_STATUS</name>
              <description>Status interrupt request of the MFS ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1_TX" -->
            <field>
              <name>MFSINT1_TX</name>
              <description>Transmission interrupt request of the MFS ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ064MON" -->
        <register>
          <name>IRQ064MON</name>
          <description>IRQ064 Batch Read Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT2_RX" -->
            <field>
              <name>MFSINT2_RX</name>
              <description>Reception interrupt request of the MFS ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ065MON" -->
        <register>
          <name>IRQ065MON</name>
          <description>IRQ065 Batch Read Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT2_STATUS" -->
            <field>
              <name>MFSINT2_STATUS</name>
              <description>Status interrupt request of the MFS ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2_TX" -->
            <field>
              <name>MFSINT2_TX</name>
              <description>Transmission interrupt request of the MFS ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ066MON" -->
        <register>
          <name>IRQ066MON</name>
          <description>IRQ066 Batch Read Register</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3_RX" -->
            <field>
              <name>MFSINT3_RX</name>
              <description>Reception interrupt request of the MFS ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ067MON" -->
        <register>
          <name>IRQ067MON</name>
          <description>IRQ067 Batch Read Register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3_STATUS" -->
            <field>
              <name>MFSINT3_STATUS</name>
              <description>Status interrupt request of the MFS ch.3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT3_TX" -->
            <field>
              <name>MFSINT3_TX</name>
              <description>Transmission interrupt request of the MFS ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ068MON" -->
        <register>
          <name>IRQ068MON</name>
          <description>IRQ068 Batch Read Register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT4_RX" -->
            <field>
              <name>MFSINT4_RX</name>
              <description>Reception interrupt request of the MFS ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ069MON" -->
        <register>
          <name>IRQ069MON</name>
          <description>IRQ069 Batch Read Register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT4_STATUS" -->
            <field>
              <name>MFSINT4_STATUS</name>
              <description>Status interrupt request of the MFS ch.4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT4_TX" -->
            <field>
              <name>MFSINT4_TX</name>
              <description>Transmission interrupt request of the MFS ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
